---
kind: method
id: M:Autodesk.Revit.DB.Structure.RebarContainerParameterManager.ClearOverrides
source: html/997a68cf-1530-13a1-91d3-484beefa51a3.htm
---
# Autodesk.Revit.DB.Structure.RebarContainerParameterManager.ClearOverrides Method

Clears any overridden values from all parameters of the associated RebarContainer element.

## Syntax (C#)
```csharp
public void ClearOverrides()
```